app/Controllers/Personas.php

    public function index()
    {
        $persona = new persona();
        $datos['Persona'] = $persona->orderBy('id', "ASC")->findAll();
---
SELECT *
FROM `persona`
ORDER BY `id` ASC